import Slider from '../../components/Slider/Slider.tsx';
import styles from './contacts.module.scss';
import contactsMap from '../../images/contactsMap.svg';
import { Link } from 'react-router-dom';
import { BsTelegram } from 'react-icons/bs';
import { SlSocialVkontakte } from 'react-icons/sl';

const Contacts = () => {
  return (
    <section>
      <Slider />
      <div className={styles.contacts__container}>
        <ul className={styles.contacts__titles}>
          <li className={styles.contacts__item}>
            <h1 className={styles.contacts__title}> Контакты</h1>
          </li>
          <li className={styles.contacts__item}>
            <h2 className={styles.contacts__sunbtitle}> Адрес офиса:</h2>
            <p className={styles.contacts__text}>
              Россия, Москва, Молодогвардейская улица, д.61 стр.36
            </p>
          </li>
          <li className={styles.contacts__item}>
            <h2 className={styles.contacts__sunbtitle}> Режим работы офиса</h2>
            <p className={styles.contacts__text}>пн-вс.: 10:00-18:00</p>
          </li>
          <li className={styles.contacts__item}>
            <h2 className={styles.contacts__sunbtitle}> Телефон </h2>
            <p className={styles.contacts__text}>+7 (499) 123-45-67</p>
          </li>
          <li className={styles.contacts__item}>
            <div className={styles.contacts__socials}>
              <h2 className={styles.contacts__text}> Мы в социальных сетях</h2>
              <Link to={''}>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="36"
                  height="36"
                  viewBox="0 0 36 36"
                  fill="none"
                  className={styles.contacts__media}
                >
                  <g clip-path="url(#clip0_542_3622)">
                    <path
                      d="M17.7083 0C7.93333 0 0 7.93333 0 17.7083C0 27.4833 7.93333 35.4167 17.7083 35.4167C27.4833 35.4167 35.4167 27.4833 35.4167 17.7083C35.4167 7.93333 27.4833 0 17.7083 0ZM25.925 12.0417C25.6594 14.8396 24.5083 21.6396 23.924 24.774C23.676 26.1021 23.1802 26.5448 22.7198 26.5979C21.6927 26.6865 20.9135 25.925 19.9219 25.2698C18.3635 24.2427 17.4781 23.6052 15.9729 22.6135C14.2198 21.4625 15.3531 20.825 16.3625 19.7979C16.6281 19.5323 21.1615 15.4062 21.25 15.0344C21.2623 14.9781 21.2607 14.9196 21.2452 14.864C21.2298 14.8085 21.201 14.7575 21.1615 14.7156C21.0552 14.6271 20.9135 14.6625 20.7896 14.6802C20.6302 14.7156 18.151 16.3625 13.3167 19.6208C12.6083 20.099 11.9708 20.3469 11.4042 20.3292C10.7667 20.3115 9.5625 19.975 8.65938 19.674C7.54375 19.3198 6.67604 19.125 6.74688 18.5052C6.78229 18.1865 7.225 17.8677 8.05729 17.5312C13.2281 15.2823 16.6635 13.7948 18.3813 13.0865C23.3042 11.0323 24.3135 10.6781 24.9865 10.6781C25.1281 10.6781 25.4646 10.7135 25.6771 10.8906C25.8542 11.0323 25.9073 11.2271 25.925 11.3688C25.9073 11.475 25.9427 11.7938 25.925 12.0417Z"
                      fill="#9FA4AF"
                    />
                  </g>
                  <defs>
                    <clipPath id="clip0_542_3622">
                      <rect width="35.4167" height="35.4167" fill="white" />
                    </clipPath>
                  </defs>
                </svg>
              </Link>
              <Link to={''}>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="36"
                  height="36"
                  viewBox="0 0 36 36"
                  fill="none"
                  className={styles.contacts__media}
                >
                  <g clip-path="url(#clip0_542_3624)">
                    <path
                      d="M18.2918 0C8.51167 0 0.583496 7.92807 0.583496 17.7081C0.583496 27.4881 8.51167 35.4162 18.2918 35.4162C28.072 35.4162 36.0002 27.4881 36.0002 17.7081C36.0002 7.92807 28.072 0 18.2918 0ZM25.1022 19.9788C25.1022 19.9788 26.6682 21.5246 27.0538 22.2421C27.0648 22.2569 27.0704 22.2716 27.0741 22.279C27.2308 22.5428 27.2677 22.7475 27.1903 22.9006C27.0611 23.1552 26.6184 23.2806 26.4672 23.2917H23.7003C23.5084 23.2917 23.1063 23.2419 22.6193 22.9062C22.2448 22.6442 21.8759 22.2145 21.5162 21.7957C20.9794 21.1723 20.5146 20.6336 20.0461 20.6336C19.9866 20.6335 19.9274 20.6429 19.8708 20.6613C19.5167 20.7757 19.0629 21.2811 19.0629 22.6276C19.0629 23.0482 18.7309 23.2899 18.4966 23.2899H17.2293C16.7977 23.2899 14.5491 23.1386 12.5569 21.0376C10.1183 18.4644 7.92323 13.3032 7.90479 13.2553C7.76644 12.9214 8.05235 12.7425 8.3641 12.7425H11.1587C11.5313 12.7425 11.653 12.9693 11.7379 13.1704C11.8375 13.4047 12.2027 14.3362 12.8022 15.3839C13.7744 17.092 14.3702 17.7856 14.8479 17.7856C14.9375 17.7845 15.0255 17.7617 15.1043 17.7192C15.7278 17.3724 15.6116 15.1497 15.5839 14.6885C15.5839 14.6018 15.5821 13.6943 15.263 13.2589C15.0342 12.9435 14.645 12.8236 14.4089 12.7794C14.5045 12.6475 14.6304 12.5406 14.776 12.4676C15.2039 12.2536 15.975 12.2223 16.7405 12.2223H17.1666C17.9967 12.2334 18.2107 12.2868 18.5113 12.3625C19.1201 12.5082 19.133 12.9011 19.0795 14.2458C19.0629 14.6276 19.0463 15.0593 19.0463 15.5684C19.0463 15.6791 19.0407 15.7971 19.0407 15.9225C19.0223 16.6069 19.0002 17.3835 19.4835 17.7026C19.5465 17.7421 19.6193 17.7632 19.6937 17.7634C19.8616 17.7634 20.367 17.7634 21.7357 15.4153C22.1578 14.6595 22.5247 13.8741 22.8333 13.0653C22.8609 13.0173 22.9421 12.8697 23.038 12.8126C23.1088 12.7765 23.1873 12.7581 23.2668 12.7591H26.552C26.9099 12.7591 27.1552 12.8126 27.2013 12.9509C27.2825 13.1704 27.1866 13.84 25.6869 15.8709L25.0173 16.7545C23.6578 18.5363 23.6578 18.6267 25.1022 19.9788Z"
                      fill="#9FA4AF"
                    />
                  </g>
                  <defs>
                    <clipPath id="clip0_542_3624">
                      <rect
                        width="35.4167"
                        height="35.4167"
                        fill="white"
                        transform="translate(0.583496)"
                      />
                    </clipPath>
                  </defs>
                </svg>
              </Link>
            </div>
          </li>
        </ul>
        <img
          className={styles.contcats__map}
          src={contactsMap}
          alt="Карта с адресом"
        />
      </div>
    </section>
  );
};

export default Contacts;
