export const CATEGORIZED_TEXT: {
    id: number;
    text: string;
}[]= [
    {id: 1,
    text: 'Системное ПО'}, 
    {id: 2,
    text: 'Прикладное ПО'},
    {id: 3,
    text: 'Инструментальное ПО'},
    {id: 4,
    text: 'Windows'},
    {id: 5,
    text: 'Adobe'},
    {id: 6,
    text: 'Антивирусы'},
    {id: 7,
    text: 'Утилиты'},
    {id: 8,
    text: 'Корпоративные системы'},
    {id: 9,
    text: 'Корпоративные системы'},
    {id: 10,
    text: 'Корпоративные системы'}
]

export const CATALOGUE_NAMES:{name: string; img: string}[] = [
  {name: 'Офисные приложения', img: ''},
  {name: 'Системное ПО', img: ''},
  {name: 'Мультимедиа', img: ''},
  {name: 'Конвекторы', img: ''},
  {name: 'Архиваторы', img: ''},
  {name: 'Безопасность', img: ''},
  {name: 'Интернет', img: ''},
  {name: 'ERP & CRM', img: ''},
];
export const FAQ_INFO: {
    id: number;
    question: string;
    answer: string;
}[] = [
    {id: 1, question: 'Где найти свой оплаченный заказ?', answer: 'Посетите личный кабинет, раздел Мои покупки.'},
    {id: 2, question: 'Как с вами связаться?', answer: 'Все доступные способы связи на странице Контакты.'},
    {id: 3, question: 'Правила обмена и возврата', answer: 'По действующему российскому законодательству, покупатель может в течение 14 календарных дней вернуть любой товар без каких‑либо причин. В такой ситуации главное, чтобы продукция не была ни разу использована и сохранила свой первоначальный вид. Стоит отметить, что программное обеспечение, различные приложения и операционные системы не подпадают под действие данного закона. Однако наши клиенты все равно могут воспользоваться таким правом в течение 14 дней со дня покупки. Нужно помнить, что вернуть можно лишь физические носители — диски. Ключи активации, полученные по электронной почте, не обладают такой гарантией. Такой подход не прихоть, а мера безопасности от взлома компьютеров, хакерских атак и разработки вредоносных программ.'}
]
